# Interest Rate Dataset w/ All Zipcodes

In [2]:
import pandas as pd
import numpy as np

In [3]:
new_df1 = pd.DataFrame({"zipcode": np.arange(90000, 96200), "low_am_0_median_interest_rate": 0})
new_df2 = pd.DataFrame({"zipcode": np.arange(90000, 96200), "low_am_1_median_interest_rate": 0})

med_int_rate_new_df1 = np.zeros(shape=(1, 6200))
med_int_rate_new_df2 = np.zeros(shape=(1, 6200))

In [5]:
for i in range(len(med_int_rate_new_df1[0])):
    if i > 5699:
        med_int_rate_new_df1[0][i] = 6.125
    elif i >= 400 and i < 500:
        med_int_rate_new_df1[0][i] = 6.1245
    elif i >= 500 and i < 600:
        med_int_rate_new_df1[0][i] = 6.4325
    elif (i >= 600 and i < 800) or (i >= 1900 and i < 2100) or (i >= 2300 and i < 2600) or (i >= 2700 and i < 3100) or (i >= 3900 and i < 4100) or (i >= 4400 and i < 4600) or (i >= 5000 and i < 5200) or (i >= 5300 and i < 5400) or (i >= 5800 and i < 5900):
        med_int_rate_new_df1[0][i] = 6.375
    elif (i >= 1000 and i < 1100) or (i >= 1300 and i < 1400) or (i >= 3300 and i < 3500) or (i >= 3700 and i < 3800) or (i >= 5900 and i < 6000):
        med_int_rate_new_df1[0][i] = 6.499
    elif i >= 1700 and i < 1800:
        med_int_rate_new_df1[0][i] = 6.25
    elif i >= 1800 and i < 1900:
        med_int_rate_new_df1[0][i] = 6.531
    elif i >= 2100 and i < 2200:
        med_int_rate_new_df1[0][i] = 6.4765
    elif i >= 2600 and i < 2700:
        med_int_rate_new_df1[0][i] = 6.478
    elif i >= 4100 and i < 4200:
        med_int_rate_new_df1[0][i] = 6.49
    elif i >= 4300 and i < 4400:
        med_int_rate_new_df1[0][i] = 6.625
    elif i >= 4600 and i < 4700:
        med_int_rate_new_df1[0][i] = 6.4155
    elif i >= 4800 and i < 4900:
        med_int_rate_new_df1[0][i] = 6.3125
    elif i >= 4900 and i < 5000:
        med_int_rate_new_df1[0][i] = 6.475
    elif i >= 5200 and i < 5300:
        med_int_rate_new_df1[0][i] = 6.4945
    elif i >= 5600 and i < 5700:
        med_int_rate_new_df1[0][i] = 6.378
    else:
        med_int_rate_new_df1[0][i] = 6.5

In [6]:
new_df1["low_am_0_median_interest_rate"] = med_int_rate_new_df1[0]

In [7]:
new_df1.head()

   zipcode  low_am_0_median_interest_rate
0    90000                            6.5
1    90001                            6.5
2    90002                            6.5
3    90003                            6.5
4    90004                            6.5

In [8]:
for i in range(len(med_int_rate_new_df2[0])):
    if (i < 200) or (i >= 2400 and i < 2500) or (i >= 5400 and i < 5500):
        med_int_rate_new_df2[0][i] = 6.000
    elif (i >= 200 and i < 500) or (i >= 3500 and i < 3600) or (i >= 3700 and i < 3800) or (i >= 3900 and i < 4000) or (i >= 4600 and i < 4700) or (i >= 4900 and i < 5000):
        med_int_rate_new_df2[0][i] = 5.875
    elif (i >= 500 and i < 600) or (i >= 2100 and i < 2200) or (i >= 2500 and i < 2600) or (i >= 4300 and i < 4400):
        med_int_rate_new_df2[0][i] = 5.375
    elif i >= 600 and i < 800:
        med_int_rate_new_df2[0][i] = 4.99
    elif (i >= 800 and i < 1000) or (i >= 1800 and i < 1900) or (i >= 3300 and i < 3400):
        med_int_rate_new_df2[0][i] = 5.000
    elif (i >= 1000 and i < 1100) or (i >= 2000 and i < 2100) or (i >= 4100 and i < 4300):
        med_int_rate_new_df2[0][i] = 5.5625
    elif (i >= 1100 and i < 1200) or (i >= 1400 and i < 1600) or (i >= 2300 and i < 2400) or (i >= 4500 and i < 4600) or (i >= 4700 and i < 4900):
        med_int_rate_new_df2[0][i] = 5.5
    elif (i >= 1200 and i < 1300) or (i >= 5700 and i < 5800):
        med_int_rate_new_df2[0][i] = 5.4375
    elif (i >= 1300 and i < 1400) or (i >= 5100 and i < 5200):
        med_int_rate_new_df2[0][i] = 5.6875
    elif (i >= 1600 and i < 1700) or (i >= 4000 and i < 4100):
        med_int_rate_new_df2[0][i] = 5.8125
    elif i >= 1700 and i < 1800:
        med_int_rate_new_df2[0][i] = 5.4995
    elif (i >= 1900 and i < 2000) or (i >= 3400 and i < 3500) or (i >= 5300 and i < 5400) or (i >= 5800 and i < 5900) or (i >= 6000 and i < 6100):
        med_int_rate_new_df2[0][i] = 5.625
    elif i >= 2700 and i < 2800:
        med_int_rate_new_df2[0][i] = 6.5
    elif i >= 2800 and i < 2900:
        med_int_rate_new_df2[0][i] = 5.645
    elif i >= 3000 and i < 3100:
        med_int_rate_new_df2[0][i] = 5.125
    elif i >= 3200 and i < 3300:
        med_int_rate_new_df2[0][i] = 5.99
    elif i >= 3600 and i < 3700:
        med_int_rate_new_df2[0][i] = 5.3125
    elif i >= 4400 and i < 4500:
        med_int_rate_new_df2[0][i] = 5.9375
    elif i >= 5000 and i < 5100:
        med_int_rate_new_df2[0][i] = 5.119
    elif i >= 5500 and i < 5600:
        med_int_rate_new_df2[0][i] = 6.125
    else:
        med_int_rate_new_df2[0][i] = 5.75

In [9]:
new_df2["low_am_1_median_interest_rate"] = med_int_rate_new_df2[0]

In [10]:
new_df2.head()

   zipcode  low_am_1_median_interest_rate
0    90000                            6.0
1    90001                            6.0
2    90002                            6.0
3    90003                            6.0
4    90004                            6.0

In [16]:
new_interest_rate_dataset = new_df1.merge(new_df2, on="zipcode")
assert new_interest_rate_dataset.isnull().values.any() == False
new_interest_rate_dataset.head()

   zipcode  low_am_0_median_interest_rate  low_am_1_median_interest_rate
0    90000                            6.5                            6.0
1    90001                            6.5                            6.0
2    90002                            6.5                            6.0
3    90003                            6.5                            6.0
4    90004                            6.5                            6.0

## Save Dataset as CSV

In [17]:
#new_interest_rate_dataset.to_csv('median_interest_rate_all_zipcodes.csv', index=False)